{"Academics": {"children": [{"children": [], "content": "The university currently offers 65 bachelor's degrees, 39 master's degrees, 84 minors and 13 credentials in six colleges: \nCollege of Agriculture, Food and Environmental Sciences\nCollege of Architecture and Environmental Design\nOrfalea College of Business\nCollege of Engineering\nCollege of Liberal Arts\nCollege of Science and Mathematics", "parent": "Academics", "py/object": "__main__.Section", "title": "Colleges"}, {"children": [], "content": "Cal Poly's admissions process is \"more selective\" according to U.S. News & World Report.For the class entering Fall 2018, 16,491 freshmen were accepted out of 54,663 applicants, a 30.2% acceptance rate, and 4,398 enrolled.  Fall 2018 entering students had an average GPA of 4.00; the middle 50% range of SAT scores was 620–700 for reading and writing, and 620–730 for math, while the ACT Composite range was 26–32.  Women constituted 51.2% of the incoming freshmen class, men 48.8%.For Fall 2018 admitted transfer students, Cal Poly accepted 1,733 of 10,923 applicants, a 15.9% acceptance rate. Cal Poly requires students to declare a major when applying for admission, and the university then admits the most competitive applicants within each major based on GPA and SAT or ACT scores. As a result, changing majors at the university is not guaranteed.  Each major has a specific change of major plan which includes required classes to be taken while maintaining a certain GPA (usually between 2.5–2.75) in order to be considered as a candidate.  In some cases, students wishing to change majors transfer to other universities.", "parent": "Academics", "py/object": "__main__.Section", "title": "Admissions"}, {"children": [], "content": "Cal Poly ranked 37th in the U.S. in PayScale 's 2018 \"College ROI Report,\" which ranked 1,878 colleges and universities.  According to PayScale's projections, Cal Poly has a 20-year net return on investment of $699,000. This ROI is the 2nd highest in the California State University system and is higher than all of the University of California schools except UC Berkeley.Washington Monthly ranked Cal Poly 23rd out of 606 schools in the U.S. \"National Universities - Masters\" category in 2019 based on its contribution to the public good in three broad categories: social mobility, research, and service.\nIn 2019, Forbes magazine rated Cal Poly No. 115 out of the 650 best private and public colleges, universities and service academies in America. In 2008, the first year of the list, Cal Poly was ranked No. 369 out of 569.Money magazine ranked Cal Poly 75th in the country out of 744 schools evaluated for its 2019-20 \"Best Colleges for Your Money\" edition.For 2019, Kiplinger ranked Cal Poly 19th out of the top 174 best-value public colleges and universities in the nation, and 3rd in California.According to U.S. News & World Report's 2020 \"Best Regional Universities West Rankings,\" Cal Poly is ranked 4th overall in the western United States out of 128 regional schools whose highest degree is a Master's, 1st in \"Top Public Schools\", 1st for \"Most Innovative Schools\", tied for 1st for \"Best Undergraduate Teaching\", 2nd in \"Best Colleges for Veterans\", and tied for 87th in \"Top Performers on Social Mobility\". The same report ranked the College of Engineering 8th out of 210 public and private undergraduate engineering schools in the U.S. where doctorates are not offered with national program rankings of:\nCivil Engineering: 3rd\nComputer Engineering: 2nd\nElectrical Engineering: 2nd\nIndustrial Engineering: 1st\nMechanical Engineering: 2ndIn the 2019 edition of \"America's Best Architecture & Design Schools\" published by the architecture and design journal DesignIntelligence, Cal Poly was ranked the No. 3 most admired undergraduate architecture program in the nation.  The landscape architecture program was ranked 6th most admired in the country and 1st in the Western region.Cal Poly's Orfalea College of Business was ranked 59th among U.S. undergraduate business colleges in Bloomberg Businessweek's 2016 list (the latest).", "parent": "Academics", "py/object": "__main__.Section", "title": "Rankings"}], "content": "", "parent": "none", "py/object": "__main__.Section", "title": "Academics"}, "Administrative organization": {"children": [{"children": [], "content": "The university is organized administratively into four divisions: Academic Affairs, Student Affairs, Administration and Finance, and University Advancement. The academic division is organized into six colleges, each with its own dean. Academic Affairs also includes the Library, Research and Graduate Programs, and Information Technology Services.", "parent": "Administrative organization", "py/object": "__main__.Section", "title": "Four administrative divisions"}, {"children": [], "content": "The Cal Poly Corporation is a public-benefit, nonprofit corporation and university auxiliary. It provides commercial services, fiscal services, and key support services to assist and promote the educational mission of Cal Poly and the California State University System (CSU). The Corporation engages only in those activities ancillary to state operation that are requested by Cal Poly's President and approved by the CSU. The corporation was founded in 1940 and was known as the Cal Poly Foundation until February 1, 2006.", "parent": "Administrative organization", "py/object": "__main__.Section", "title": "Cal Poly Corporation"}, {"children": [], "content": "The Cal Poly Foundation is an auxiliary organization and IRC 501(c)(3) public charity that accepts and administers tax deductible gifts to the university. The Cal Poly Foundation leads campus philanthropic activity by supporting fundraising activities and investing and managing the campus endowments.", "parent": "Administrative organization", "py/object": "__main__.Section", "title": "Cal Poly Foundation"}, {"children": [], "content": "The Cal Poly Extended Education provides access to degree, certificate, and professional development programs and services of the university to the citizens of San Luis Obispo, Santa Barbara, and Monterey Counties and through distance learning technologies to students across the country.", "parent": "Administrative organization", "py/object": "__main__.Section", "title": "Cal Poly Extended Education"}, {"children": [], "content": "The Cal Poly Alumni Association seeks to engage and serve alumni, to foster a lifelong connection between the University and its alumni, and to foster goodwill and support for the University.  The association includes 15 regional and special interest chapters.", "parent": "Administrative organization", "py/object": "__main__.Section", "title": "Alumni Association"}], "content": "", "parent": "none", "py/object": "__main__.Section", "title": "Administrative organization"}, "Athletics": {"children": [], "content": "Cal Poly fields 21 varsity sports (10 for men and 11 for women) and participates in the NCAA's Division I.\nCal Poly competes in the Big West Conference, except for football and wrestling (neither of which are sponsored by the Big West).  Cal Poly's football team competes in the Big Sky Conference; the wrestling team is a member of the Pac-12 Conference.  Prior to joining Division I in 1994, the school won 35 NCAA Division II national team championships and competed in the NCAA Division II California Collegiate Athletic Association (CCAA). Cal Poly has two mascots. The character represented in costume or cartoon is named Musty the Mustang. The live mascot, a living mustang, is named Chase, after Margaret Chase, the university's second president.Cal Poly also offers various non varsity sports.  The Mustangs play college rugby in the California conference of Division 1-A. The Mustangs are often ranked in the Top 25 nationwide, and their rugby sevens team has been ranked as high as 7th. The Mustangs finished 8th in the nation at the 2011 USA Rugby Sevens Collegiate National Championships, and 12th at the 2012 competition.", "parent": "none", "py/object": "__main__.Section", "title": "Athletics"}, "Campus": {"children": [{"children": [{"children": [], "content": "", "parent": "Expansion", "py/object": "__main__.Section", "title": "Recent construction"}, {"children": [], "content": "", "parent": "Expansion", "py/object": "__main__.Section", "title": "Current and planned construction"}], "content": "The Cal Poly Master Plan calls to increase student population from approximately 17,000 students to 20,900 students by the year 2020–2021. To maintain the university's Learn by Doing philosophy and low class sizes, the master plan calls for an increase in classrooms, laboratories, and professors.", "parent": "Campus", "py/object": "__main__.Section", "title": "Expansion"}, {"children": [], "content": "Campus parking is limited. In its most recent survey of available parking spaces on campus, the Cal Poly University Police reported 2,892 general purpose parking spaces, 3,492 dorm resident spaces, and 8,648 total spaces. In its facilities Master Plan, the university admits that while more parking spots will be added, the actual ratio of parking to students will decrease since enrollment is expected to increase sharply. To resolve the disparity, the Master Plan calls on the university to reduce the demand for individual vehicle parking. As part of that plan, the university has constructed additional dorms and has tried to make campus life more desirable. In addition, Cal Poly Commuter and Access Services has successfully promoted alternatives to commuting in single occupancy vehicles: in the past 10 years, bus use has more than doubled and the use of bicycles has close to quadrupled.Currently, there are over 6,500 bike rack spaces and 224 secure bike lockers available on campus; 57% of students and 33% of faculty/staff live within 5 miles of the Cal Poly campus, an easy bike commute. The city's SLO Transit bus system provides service to and from campus. Cal Poly financially supports SLO Transit with funding from parking citation revenue (not from state general funds nor from student tuition), so faculty, staff, and students ride for free. Bus service throughout the county is provided by SLO Regional Transit Authority. Discounted passes are available to the Cal Poly community.", "parent": "Campus", "py/object": "__main__.Section", "title": "Commuting"}], "content": "Cal Poly has one of the largest college campuses in the United States. It owns 9,178 acres and is the second largest land-holding university in California. The lands are used for student education and include the main campus, two nearby agricultural lands, and two properties in Santa Cruz County. Part of the Cal Poly property is the Swanton Pacific Ranch, a 3,200-acre (1,300 ha) ranch located in Santa Cruz County, California, outside the town of Davenport. The ranch provides educational and research opportunities, encompasses rangeland, livestock, and forestry operations for the College of Agriculture, Food, and Environmental sciences, and fosters Cal Poly's Learn by Doing teaching philosophy of with emphasis on sustainable management of agricultural practices with a mix of laboratory experiments.", "parent": "none", "py/object": "__main__.Section", "title": "Campus"}, "Directors and presidents": {"children": [], "content": "Leroy Anderson, 1902–1907\nLeroy Burns Smith, 1908–1914\nRobert Weir Ryder, 1914–1921\nNicholas Ricciardi, 1921–1924\nMargaret Chase (Acting), 1924\nBenjamin Ray Crandall, 1924–1933\nJulian A. McPhee, 1933–1966\nDale W. Andrews (acting), 1966–1967\nRobert E. Kennedy, 1967–1979\nWarren J. Baker, 1979–2010\nRobert Glidden (Acting), 2010–2011\nJeffrey D. Armstrong, 2011–present", "parent": "none", "py/object": "__main__.Section", "title": "Directors and presidents"}, "External links": {"children": [], "content": "Official website\nCal Poly Athletics website", "parent": "none", "py/object": "__main__.Section", "title": "External links"}, "Financial": {"children": [{"children": [], "content": "Due to continued reductions in state funding, Fall 2011 fees for the average student reached approximately $2,600 per quarter. For comparison, the Spring 2002 fees for the average student were $760 per quarter.  While total yearly fees for an in-state student were just $2,976 in 2002, students entering in fall 2011 faced an annual fee of over $7,900.Of the students enrolled in fall 2014, 61.6% of undergraduates and 70.0% of first-time freshmen received some form of financial aid in 2014–15. The amount of financial aid awarded in 2014–15 totaled $151.5 million, of which 64.3% came from federal funds, 11.9% came from state funds and 17.5% came from institutional funds. Loans comprised 55.6% of the financial aid, 31.2% came in the form of grants, and 10.2% in scholarships.", "parent": "Financial", "py/object": "__main__.Section", "title": "Tuition"}, {"children": [], "content": "Cal Poly's endowment more than tripled during its Centennial Campaign from $43.1 million to $140.1 million. Growth is attributed to gifts and prudent stewardship. However, since 2007, the university's endowment has fluctuated dramatically, going from $181.7 million in 2007 to $130.9 million in 2009, before rebounding to $227.7 million in 2019, the 301st largest of 785 colleges and universities in the United States and Canada.", "parent": "Financial", "py/object": "__main__.Section", "title": "Endowment"}], "content": "", "parent": "none", "py/object": "__main__.Section", "title": "Financial"}, "History": {"children": [{"children": [], "content": "Cal Poly Pomona began as a satellite campus of Cal Poly San Luis Obispo in 1938 when a completely equipped school and farm were donated by Charles Voorhis and his son Jerry Voorhis of Pasadena, California, and was initially called the Voorhis Unit. The W.K. Kellogg Foundation then donated an 812-acre (329 ha) horse ranch in Pomona, California to Cal Poly San Luis Obispo in 1949.  Located about one mile (1.6 km) from the Voorhis campus, the two became known as Cal Poly Kellogg-Voorhis. Cal Poly Kellogg-Voorhis broke off from Cal Poly in 1966, becoming the fully independent university, California State Polytechnic University, Pomona (Cal Poly Pomona). Since 1949, the two campuses have cooperated on creating a float for the Rose Parade. Today, the long-running float program still boasts floats designed and constructed entirely by students year-round on both campuses.", "parent": "History", "py/object": "__main__.Section", "title": "Relationship with Cal Poly Pomona"}, {"children": [], "content": "On October 29, 1960, a chartered plane carrying the Cal Poly San Luis Obispo football team, hours after a loss to Bowling Green State University, crashed on takeoff at the Toledo Express Airport in Toledo, Ohio. Twenty-two of the 48 people on board were killed, including 16 players.", "parent": "History", "py/object": "__main__.Section", "title": "1960 football team plane crash"}, {"children": [], "content": "In 1903, Cal Poly San Luis Obispo opened as a coeducational school with 20 students enrolled, 16 new male students and 4 new female students. In 1930, Cal Poly San Luis Obispo banned women from the entire school until 1956 when it once again began admitting female students. The university remains coeducational today, with women constituting 46.7% of the Fall 2015 total student population.", "parent": "History", "py/object": "__main__.Section", "title": "Female admissions"}], "content": "Cal Poly San Luis Obispo was established as the California Polytechnic School in 1901 when Governor Henry T. Gage signed the California Polytechnic School Bill after a campaign by journalist Myron Angel. The polytechnic school held its first classes on October 1, 1903 to 20 students, offering secondary level courses of study, which took three years to complete. The school continued to grow steadily, except during a period from the mid 1910s to the early 1920s when World War I led to drops in enrollment and drastic budget cuts forced fewer class offerings.\nIn 1924, Cal Poly San Luis Obispo was placed under the control of the California State Board of Education. In 1933, the Board of Education changed Cal Poly San Luis Obispo into a two-year technical and vocational school. The institution began to offer Bachelor of Arts degrees in 1940, with the first baccalaureate exercises held in 1942. The school was renamed the California State Polytechnic College in 1947 to better reflect its higher education offerings, and in 1949, a Master of Arts degree in education was added. In 1960, control of Cal Poly San Luis Obispo and all other state colleges was transferred from the State Board of Education to an independent Board of Trustees, which later became the California State University system.The college was authorized to offer Master of Science degrees in 1967, and from then to 1970, the school's curriculum was reorganized into different units, such as the School of Science and Math, the School of Agriculture and Natural Resources, and the School of Architecture. Cal Poly San Luis Obispo's FM radio station, KCPR,  began as a senior project in 1968. The state legislature changed the school's official name again in 1971 to California Polytechnic State University, and since the 1970s the university has seen steady enrollment growth and building construction.\nCal Poly San Luis Obispo celebrated its centennial in 2001 and kicked off a $225 million fundraising campaign, the largest fund-raising effort undertaken in CSU history. The Centennial Campaign raised over $264 million from over 81,000 donors, more than tripling the university's endowment from $43 million to over $140 million.\nOn May 3, 2017, Cal Poly received one of the largest gifts towards public education to be received in California from Cal Poly alumnus William L. and Linda Frost in the amount of $110 million.", "parent": "none", "py/object": "__main__.Section", "title": "History"}, "Incidents and controversies": {"children": [{"children": [], "content": "On April 29, 1990, San Luis Obispo police responded to a call of a bicyclist down at around 11pm. The activity drew heavily intoxicated crowds that began to get unruly. After unsuccessfully attempting to disperse the crowd, a mob began looting the nearby Campus Bottle Shoppe. The next day, dumpsters were set on fire during more rioting and 127 people were arrested.", "parent": "Incidents and controversies", "py/object": "__main__.Section", "title": "Poly Royal Riots"}, {"children": [], "content": "On May 25, 1996, Cal Poly student Kristin Smart disappeared without a trace after a birthday party. The university and sheriff's department have been investigating leads, including excavating the land around the Cal Poly \"P\" on an adjoining hill. As of 2017, the excavation of the area surrounding has been completed with articles found, however the sheriff's department has not yet released what the findings are.", "parent": "Incidents and controversies", "py/object": "__main__.Section", "title": "Disappearance of Kristin Smart"}, {"children": [], "content": "In 2008, a university-owned house (known as Crops House) where agriculture students were given subsidized lodging in exchange for work on the school's farms displayed a racist sign posted during a party which read: “No niggers,” along with a similar slur against gays. At a later date, the house displayed a confederate flag tacked above the entrance to the house, draped near a hangman's noose while a large Confederate flag laid painted on a table in front of the house.", "parent": "Incidents and controversies", "py/object": "__main__.Section", "title": "Crops House incident"}, {"children": [], "content": "In 2015, the Pi Kappa Alpha fraternity was suspended for six years following a report of sexual assault, unsafe alcohol consumption and other conduct policy violations at a party in October, 2014. In December, 2017, the chapter voted to surrender its national charter, officially dissolving the chapter.", "parent": "Incidents and controversies", "py/object": "__main__.Section", "title": "Pi Kappa Alpha fraternity suspension"}, {"children": [], "content": "In 2018, the Lambda Chi Alpha fraternity was suspended following a photo surfacing that showed a student wearing blackface. In response to further protests, President Armstrong suspended all Greek Life on campus indefinitely. This was followed with protests during Open House events for incoming freshmen. On May 4, 2018, President Armstrong announced yet another blackface incident that was mocking the prior incident. The incident is being investigated by the state.", "parent": "Incidents and controversies", "py/object": "__main__.Section", "title": "Blackface incident"}], "content": "", "parent": "none", "py/object": "__main__.Section", "title": "Incidents and controversies"}, "Name": {"children": [], "content": "The school is typically referred to as \"Cal Poly\", or simply \"Poly\".  The university's style guide indicates its official names are \"California Polytechnic State University\" and \"Cal Poly.\" When necessary to distinguish between Cal Poly and its former satellite campus, Cal Poly Pomona, the lengthier \"Cal Poly at San Luis Obispo\" is occasionally used. The California State University system's style guide identifies the university as \"California Polytechnic State University, San Luis Obispo\" and the elided \"Cal Poly San Luis Obispo.\" Although Cal Poly San Luis Obispo is part of the California State University, its naming convention does not follow that of most campuses within the system (for example, the CSU campus in San Diego bears the full official name \"San Diego State University\" and the CSU campus in Fullerton uses the name \"California State University, Fullerton\"). Thus, \"San Luis Obispo State University\" or \"California State University, San Luis Obispo\" are seldom used.", "parent": "none", "py/object": "__main__.Section", "title": "Name"}, "Notable alumni": {"children": [], "content": "Cal Poly has more than 150,000 alumni with the majority located in San Luis Obispo, Santa Clara and Los Angeles counties.  Alumni include Abel Maldonado, Former California Lt. Governor; Devin Nunes, U.S. Representative; Peter Oppenheimer, Chief Financial Officer of Apple Inc.; Farzad Nazem, Chief Technology Officer of Yahoo; Linda Ozawa, founder of Jamba Juice; Richard Bergquist, founder of PeopleSoft; Gary Erickson, founder of Clif Bar; Noel Lee, founder of Monster Cable; William Swanson, CEO and founder of Raytheon; Burt Rutan, aerospace pioneer; Weird Al Yankovic, comedic musician; and John Madden, NFL Hall of Fame coach, David Nwaba, shooting guard for the Brooklyn Nets, Ozzie Smith, Baseball Hall of Fame Major League Baseball player, and NASA Astronaut Victor Glover.", "parent": "none", "py/object": "__main__.Section", "title": "Notable alumni"}, "References": {"children": [{"children": [], "content": "", "parent": "References", "py/object": "__main__.Section", "title": "Notes"}, {"children": [], "content": "", "parent": "References", "py/object": "__main__.Section", "title": "Citations"}, {"children": [], "content": "Pflueger, Donald (1999) [1991], California State Polytechnic University, Pomona: A Legacy and a Mission, Spokane, Washington: Arthur H. Clark Company, ISBN 0-9622822-1-9, OCLC 43853707", "parent": "References", "py/object": "__main__.Section", "title": "Sources"}], "content": "", "parent": "none", "py/object": "__main__.Section", "title": "References"}, "Relations with local community": {"children": [], "content": "Though generally regarded as a positive for the area due to the economic impact, Cal Poly has received criticism for both the behavior of students upsetting the community, and the effects on local housing market. Parties and gatherings have gotten wilder due to an increased student body size and social media presence, leading to the university being named the #9 party school in California by Niche. In 2017, the median home price in San Luis Obispo was $530,000. In May 2018, Zillow estimated that the median home value has increased to $694,027. While the city has been building hundreds of single family housing on the south end of town, large areas of the north end in older neighborhoods have been converted to rental student housing because of a major increase in the number of students admitted to and attending the university and the lack of university supplied housing. The university is currently building housing on campus to attempt to house up to 65% of students and plans to cap enrollment at 25,000, meaning that 11,250 students must find off-campus housing. This has created an affordability crisis for the city itself, as most apartments that would generally be occupied by lower income families and individuals are now occupied solely by Cal Poly students, reducing supply and pushing low-income residents outside of the city. Approximately 27% of the residents live below the poverty line, a similar percentage to Cleveland, Ohio.", "parent": "none", "py/object": "__main__.Section", "title": "Relations with local community"}, "See also": {"children": [], "content": "California Master Plan for Higher Education\nLeaning Pine Arboretum, north campus", "parent": "none", "py/object": "__main__.Section", "title": "See also"}, "Student life": {"children": [{"children": [], "content": "Cal Poly's on-campus student housing of 6,239 spaces is the largest student housing program in the California State University system. Cal Poly housed 35.9% of fall 2015 undergraduates in 28 dorms on campus, and 98.7% of first-time freshmen lived on campus. In addition, 28.7% of Cal Poly sophomores lived on campus in fall 2015.There are five distinct groups of residence halls on the Cal Poly campus. The five North Mountain halls, constructed in the 1950s, are the oldest on campus still used for residential purposes. The six \"red-brick\" halls were completed shortly afterward in 1959. The Sierra Madre and Yosemite halls were finished by 1968, and the Cerro Vista Apartments were completed in 2003. The Poly Canyon Village housing complex, with a similar style as the Cerro Vista apartments, was completed in 2009 at a cost of $300 million, making it the California State University system's largest construction project to date.Each of the residence halls represent a different living community on campus. The six red-brick halls are the Living-Learning Program halls for the different colleges of Cal Poly. The five North Mountain halls are organizationally a part of the engineering Living-Learning Program. The Sierra Madre and Yosemite halls are the First-Year Connection Program halls and focus on freshman-oriented transition programs.  All buildings house students of all majors.  The Cerro Vista Apartments is the Transitions community for first-year and second-year students. Poly Canyon Village is the Sophomore Success Program community, which is open to primarily to sophomores, but also juniors and seniors, and helps students transition into independent living.", "parent": "Student life", "py/object": "__main__.Section", "title": "Residence halls"}, {"children": [], "content": "Greek organizations have been at Cal Poly since 1949. The Greek community consists of three governing councils at Cal Poly: United Sorority and Fraternity Council (USFC), Interfraternity Council (IFC), and Panhellenic Association (PHA). Cal Poly also offers Greek organizations based on academic fields of study.As of April 17, 2018, Greek Life has been suspended indefinitely by the university following a number of racial controversies, the most recent of which being the 2018 Cal Poly Blackface Incident.", "parent": "Student life", "py/object": "__main__.Section", "title": "Greek life"}, {"children": [], "content": "The Week of Welcome program, more commonly known as \"WOW\", serves as a volunteer-based orientation program for new students during the first week after move-in during the beginning of the school year in September. Its purpose is to introduce students to the campus and the community and prepare them for a successful college career. Freshmen are placed in a group with 10–12 other new students while transfer students are in groups of 40-60; each group is led by two current Cal Poly student orientation leaders.  The \"WOW\" groups participate in an array of orientation events in addition to activities both on- and off-campus. In 2010, the awareness section of the program won the 2010 National Orientation Directors Association (NODAC) Media & Publications Showcase Award in the Emerging Technologies. The awareness section was entirely developed by student volunteers. The program started in 1956 and is now the largest volunteer orientation program in the nation.", "parent": "Student life", "py/object": "__main__.Section", "title": "Week of Welcome orientation program"}, {"children": [], "content": "The Cal Poly Recreation Center is the on-campus student recreation center.", "parent": "Student life", "py/object": "__main__.Section", "title": "Cal Poly Recreation Center"}, {"children": [], "content": "Cal Poly has many recognized clubs and independent student organizations operating on campus. Included (a full list available on the Associated Students, Incorporated website) are over 150 groups, including, among many others, cultural clubs and exchanges, mathematics and science clubs, religious and atheistic groups, service organizations, engineering research and development clubs, professional development organizations, a perennial Rose Parade Float design program, LGBTQ+ and Multicultural groups, competitive and social athletic teams, and academic honors clubs. Especially impressive are the engineering clubs and independent student organizations on campus such as Prove Lab, PolySat, CubeSat, and QL+.", "parent": "Student life", "py/object": "__main__.Section", "title": "Clubs and independent student organizations"}, {"children": [], "content": "As of 2018, Cal Poly San Luis Obispo has the least racially diverse student population of all California State University and University of California campuses, though it is still far more diverse than the surrounding community it serves.  On a national scale, however, Cal Poly is ranked 240 out of 2,475 colleges and is considered \"highly diverse\" by collegefactual.com.  President Armstrong has been working to increase the percentage of non-white students on campus, with the share of white students in the university student body decreasing from 63% to 55%. The city of San Luis Obispo is 84.5% white. About 84.2% of the students attending California Polytechnic State University - San Luis Obispo come from within California.The Los Angeles Times reported that the university \"was ranked one of the nation’s worst serving institutions for Latino student success.\"The Education Trust lists the university as an \"Engine of Inequality\" because \"very few students come from working-class and low-income families.\" It's one among 20 public institutions in the U.S. with this negative distinction.", "parent": "Student life", "py/object": "__main__.Section", "title": "Racial and economic diversity of student body"}], "content": "", "parent": "none", "py/object": "__main__.Section", "title": "Student life"}}